# Задайте список из вещественных чисел. Напишите программу,
# которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
#
# Пример:
#
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19


list = [1.1, 1.2, 3.1, 5, 10.01]
max_num = 0
min_num = 1

for n in [x%1 for x in list]:
    if n > max_num:
        max_num = n
    elif n < min_num:
        min_num = n

print(f"Difference = {max_num - min_num}")
